// Задайте двумерный массивю Найдите элементы, у которых оба индекса четные, и замените эти элементы на их квадраты.


Console.WriteLine("Hello, World!");
